brandonbraun653/Thor/Thor/thor_stm32hal_usart.cpp
/********************************************************************************
 * File Name:
 *   thor_usart.cpp
 *
 * Description:
 *   Implements the USART interface for Thor
 *
 * 2019 | Brandon Braun | brandonbraun653@gmail.com
 ********************************************************************************/

#if ( THOR_STM32HAL_DRIVERS == 1 ) && ( THOR_DRIVER_USART == 1 )

/* Boost Includes */
#include <boost/bind.hpp>
#include <boost/circular_buffer.hpp>

/* Chimera Includes */
#include <Chimera/thread>
#include <Chimera/watchdog.hpp>

/* Thor Includes */
#include <Thor/core.hpp>
#include <Thor/defaults/serial_defaults.hpp>
#include <Thor/definitions/serial_definitions.hpp>
#include <Thor/dma.hpp>
#include <Thor/headers.hpp>
#include <Thor/usart.hpp>

/* Mock Includes */
#if defined( GMOCK_TEST )
#include "mock_stm32_hal_usart.hpp"
#endif

using namespace Thor;
using namespace Thor::Serial;
using namespace Thor::USART;
using namespace Thor::GPIO;
using namespace Thor::Interrupt;
using namespace Chimera::Serial;

/*------------------------------------------------
Local Functions Declarations
------------------------------------------------*/
static constexpr bool isChannelSupported( const uint8_t channel );
static void USART1ISRPostProcessor( void *argument );
static void USART2ISRPostProcessor( void *argument );
static void USART3ISRPostProcessor( void *argument );
static void USART6ISRPostProcessor( void *argument );

static uint32_t usartClockMask( USART_TypeDef *const instance );
static volatile uint32_t *getUsartClockReg( USART_TypeDef *const instance );
static USARTClass *const getUSARTClassRef( USART_TypeDef *const instance );

/*------------------------------------------------
Local Data
------------------------------------------------*/
static std::array<USARTClass *, MAX_SERIAL_CHANNELS + 1> usartObjects;

/* Post Processor Thread Handles */
static std::array<TaskHandle_t, MAX_SERIAL_CHANNELS + 1> isrPPHandle;

/* Post Processor Thread Wakeup Signals */
static std::array<SemaphoreHandle_t, MAX_SERIAL_CHANNELS + 1> isrPPWakeup;

/* Post Processor Thread Function Pointers */ 
/* clang-format off */
static std::array<Chimera::Function::void_func_void_ptr, MAX_SERIAL_CHANNELS + 1> isrPPThread = { 
  nullptr, 
  USART1ISRPostProcessor, 
  USART2ISRPostProcessor, 
  USART3ISRPostProcessor,
  nullptr, 
  nullptr, 
  USART6ISRPostProcessor, 
  nullptr, 
  nullptr
}; /* clang-format on */


namespace Thor::USART::STM32HAL
{
  inline void USART_ClearIT_IDLE( USART_HandleTypeDef *const UsartHandle )
  {
#if defined( STM32F7 )
    __HAL_USART_CLEAR_IT( UsartHandle, USART_CLEAR_IDLEF );
#endif
  }

  inline void USART_EnableIT_IDLE( USART_HandleTypeDef *const UsartHandle )
  {
    USART_ClearIT_IDLE( UsartHandle );

#if defined( SIM )
#else
    __HAL_USART_ENABLE_IT( UsartHandle, USART_IT_IDLE );
#endif /* SIM */
  }

  inline void USART_DisableIT_IDLE( USART_HandleTypeDef *const UsartHandle )
  {
    USART_ClearIT_IDLE( UsartHandle );
#if defined( SIM )
#else
    __HAL_USART_DISABLE_IT( UsartHandle, USART_IT_IDLE );
#endif /* SIM */
  }

  USARTClass::USARTClass()
  {
    using namespace Chimera::Hardware;

    /*------------------------------------------------
    Register the mode change function pointers
    ------------------------------------------------*/
    modeChangeFuncPtrs[ static_cast<uint8_t>( SubPeripheralMode::BLOCKING ) ]  = &USARTClass::setBlockingMode;
    modeChangeFuncPtrs[ static_cast<uint8_t>( SubPeripheralMode::INTERRUPT ) ] = &USARTClass::setInterruptMode;
    modeChangeFuncPtrs[ static_cast<uint8_t>( SubPeripheralMode::DMA ) ]       = &USARTClass::setDMAMode;

    /*------------------------------------------------
    Register the read function pointers
    ------------------------------------------------*/
    readFuncPtrs[ static_cast<uint8_t>( SubPeripheralMode::BLOCKING ) ]  = &USARTClass::readBlocking;
    readFuncPtrs[ static_cast<uint8_t>( SubPeripheralMode::INTERRUPT ) ] = &USARTClass::readInterrupt;
    readFuncPtrs[ static_cast<uint8_t>( SubPeripheralMode::DMA ) ]       = &USARTClass::readDMA;

    /*------------------------------------------------
    Register the write function pointers
    ------------------------------------------------*/
    writeFuncPtrs[ static_cast<uint8_t>( SubPeripheralMode::BLOCKING ) ]  = &USARTClass::writeBlocking;
    writeFuncPtrs[ static_cast<uint8_t>( SubPeripheralMode::INTERRUPT ) ] = &USARTClass::writeInterrupt;
    writeFuncPtrs[ static_cast<uint8_t>( SubPeripheralMode::DMA ) ]       = &USARTClass::writeDMA;

    AUTO_ASYNC_RX = false;

    dmaRXReqSig = Thor::DMA::Source::NONE;
    dmaTXReqSig = Thor::DMA::Source::NONE;

    rxCompleteWakeup = nullptr;
    txCompleteWakeup = nullptr;

    awaitEventRXComplete = xSemaphoreCreateBinary();
    awaitEventTXComplete = xSemaphoreCreateBinary();

    txMode = Chimera::Hardware::SubPeripheralMode::UNKNOWN_MODE;
    rxMode = Chimera::Hardware::SubPeripheralMode::UNKNOWN_MODE;

#if defined( GMOCK_TEST )
    if ( !STM32HAL_Mock::usartMockObj )
    {
      STM32HAL_Mock::usartMockObj = std::make_shared<STM32HAL_Mock::USARTNiceMock>();
    }
#endif /* GMOCK_TEST */
  }

  USARTClass::~USARTClass()
  {
    usartObjects[ usart_channel ] = nullptr;
  }

  Chimera::Status_t USARTClass::assignHW( const uint8_t channel, const Chimera::Serial::IOPins &pins )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    if ( !isChannelSupported( channel ) )
    {
      error                             = Chimera::CommonStatusCodes::NOT_SUPPORTED;
      PeripheralState.hardware_assigned = false;
    }
    else
    {
      asyncRXDataSize = 0;

      /*------------------------------------------------
      Assign the default handle settings
      ------------------------------------------------*/
      usartObjects[ channel ] = this;
      usart_channel           = channel;
      usart_handle.Init       = dflt_USART_Init;
      usart_handle.Instance   = const_cast<USART_TypeDef *>( hwConfig[ usart_channel ]->instance );

