brandonbraun653/Thor/Thor/thor_stm32hal_usart.cpp
      /*------------------------------------------------
      Copy over the interrupt settings information
      ------------------------------------------------*/
      ITSettings_HW     = hwConfig[ usart_channel ]->IT_HW;
      ITSettings_DMA_TX = hwConfig[ usart_channel ]->dmaIT_TX;
      ITSettings_DMA_RX = hwConfig[ usart_channel ]->dmaIT_RX;

      dmaTXReqSig = Thor::Serial::DMATXRequestSignal[ usart_channel ];
      dmaRXReqSig = Thor::Serial::DMARXRequestSignal[ usart_channel ];

      /*------------------------------------------------
      Initialize the GPIO pins
      ------------------------------------------------*/
      const auto tx_port    = Thor::GPIO::convertPort( pins.tx.port );
      const auto tx_pin_num = Thor::GPIO::convertPinNum( pins.tx.pin );

      if ( !tx_port || ( tx_pin_num == PinNum::NOT_A_PIN ) )
      {
        error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
      }
      else
      {
        tx_pin = std::make_shared<Thor::GPIO::GPIOClass>();
        tx_pin->initAdvanced( tx_port, tx_pin_num, PinSpeed::ULTRA_SPD, pins.tx.alternate );
      }

      const auto rx_port    = Thor::GPIO::convertPort( pins.rx.port );
      const auto rx_pin_num = Thor::GPIO::convertPinNum( pins.rx.pin );

      if ( !rx_port || ( rx_pin_num == PinNum::NOT_A_PIN ) )
      {
        error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
      }
      else
      {
        rx_pin = std::make_shared<Thor::GPIO::GPIOClass>();
        rx_pin->initAdvanced( rx_port, rx_pin_num, PinSpeed::ULTRA_SPD, pins.rx.alternate );
      }

      USART_GPIO_Init();
      PeripheralState.hardware_assigned = true;
    }

    return error;
  }

  Chimera::Status_t USARTClass::begin( const Chimera::Hardware::SubPeripheralMode txMode,
                                       const Chimera::Hardware::SubPeripheralMode rxMode )
  {
    using namespace Chimera::Hardware;

    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    /*------------------------------------------------
    Transition to the desired user operating mode
    ------------------------------------------------*/
    error = setMode( Chimera::Hardware::SubPeripheral::TX, txMode );
    if ( error == Chimera::CommonStatusCodes::OK )
    {
      error = setMode( Chimera::Hardware::SubPeripheral::RX, rxMode );
    }

    /*------------------------------------------------
    Register the ISR post processor thread
    ------------------------------------------------*/
    if ( ( error == Chimera::CommonStatusCodes::OK ) && isrPPThread[ usart_channel ] )
    {
      isrPPWakeup[ usart_channel ] = xSemaphoreCreateBinary();
      isrPPHandle[ usart_channel ] = nullptr;

      Chimera::Threading::addThread( isrPPThread[ usart_channel ], "", 500, NULL, 5, &isrPPHandle[ usart_channel ] );
    }

    return error;
  }

  Chimera::Status_t USARTClass::end()
  {
    using namespace Chimera::Hardware;

    USART_DeInit();
    USART_GPIO_DeInit();
    USART_DisableInterrupts();
    USART_DMA_DeInit( Chimera::Hardware::SubPeripheral::TX );
    USART_DMA_DeInit( Chimera::Hardware::SubPeripheral::RX );

    txMode = SubPeripheralMode::UNKNOWN_MODE;
    rxMode = SubPeripheralMode::UNKNOWN_MODE;

    return Chimera::CommonStatusCodes::OK;
  }

  Chimera::Status_t USARTClass::configure( const uint32_t baud, const Chimera::Serial::CharWid width,
                                           const Chimera::Serial::Parity parity, const Chimera::Serial::StopBits stop,
                                           const Chimera::Serial::FlowControl flow )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    if ( !PeripheralState.hardware_assigned )
    {
      error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
    }
    else
    {
      bool result = true;

      USART_InitTypeDef init = usart_handle.Init;

      init.BaudRate = baud;
      result |= setWordLength( init, width );
      result |= setParity( init, parity );
      result |= setStopBits( init, stop );

      if ( result )
      {
        error = USART_Init();
      }
      else
      {
        error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
      }
    }

    return error;
  }

  Chimera::Status_t USARTClass::setBaud( const uint32_t baud )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    if ( !PeripheralState.hardware_assigned )
    {
      error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
    }
    else
    {
      /*------------------------------------------------
      Copy, modify, write
      ------------------------------------------------*/
      USART_InitTypeDef init = usart_handle.Init;
      init.BaudRate          = baud;
      usart_handle.Init      = init;

      /*------------------------------------------------
      Clear the hardware config and re-initialize with new settings
      ------------------------------------------------*/
      USART_DeInit();
      USART_Init();
    }

    return error;
  }

  Chimera::Status_t USARTClass::setMode( const Chimera::Hardware::SubPeripheral periph,
                                         const Chimera::Hardware::SubPeripheralMode mode )
  {
    using namespace Chimera::Hardware;

    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;
    auto iter               = static_cast<uint8_t>( mode );

    /*------------------------------------------------
    Only bother changing modes if we currently aren't there
    ------------------------------------------------*/
    if ( !( ( ( periph == SubPeripheral::TX ) && ( txMode == mode ) ) ||
            ( ( periph == SubPeripheral::RX ) && ( rxMode == mode ) ) ) )
    {
      /*------------------------------------------------
      No matter what, the hardware must be assigned, configured, and transitioning to a valid mode.
      ------------------------------------------------*/
      if ( iter >= modeChangeFuncPtrs.size() )
      {
        error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
      }
      else if ( !PeripheralState.hardware_assigned || !PeripheralState.configured )
      {
        error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
      }

