brandonbraun653/Thor/Thor/thor_stm32hal_usart.cpp
        /*------------------------------------------------
        Copy out the data
        ------------------------------------------------*/
        for ( size_t x = 0; x < num_received; x++ )
        {
          rxBuffers.external->push_back( rxBuffers.internal[ x ] );
        }

        /*------------------------------------------------
        Go back to async RX listening
        ------------------------------------------------*/
        memset( rxBuffers.internal, 0, rxBuffers.internalSize );
        Thor::USART::USART_EnableIT_IDLE( &usart_handle );
        HAL_USART_Receive_DMA( &usart_handle, rxBuffers.internal, rxBuffers.internalSize );
      }

      /*------------------------------------------------
      Exit the ISR ensuring that we can still receive asynchronous data
      ------------------------------------------------*/
      eventBits &= ~Chimera::Event::Flags::BIT_READ_COMPLETE;
      rx_complete   = true;
      AUTO_ASYNC_RX = true;

      /*------------------------------------------------
      Let user threads know the transfer completed
      ------------------------------------------------*/
      if ( rxCompleteWakeup )
      {
        xSemaphoreGive( *rxCompleteWakeup );
      }

      /*------------------------------------------------
      Wake up whatever thread called await()
      ------------------------------------------------*/
      xSemaphoreGive( awaitEventRXComplete );
    }

    isrPostProcessingComplete = true;
  }

  Chimera::Status_t USARTClass::readAsync( uint8_t *const buffer, const size_t len )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    if ( !buffer )
    {
      error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
    }
    else
    {
      size_t bytesRead = 0;

      if ( auto tmp = rxBuffers.get(); tmp )
      {
        while ( !tmp->empty() && ( bytesRead < len ) )
        {
          buffer[ bytesRead ] = tmp->front();
          tmp->pop_front();
          bytesRead++;
        }
      }


      if ( bytesRead != len )
      {
        error = Chimera::CommonStatusCodes::EMPTY;
      }
    }

    return error;
  }

  Chimera::Status_t USARTClass::enableBuffering( const Chimera::Hardware::SubPeripheral periph,
                                                 boost::circular_buffer<uint8_t> *const userBuffer, uint8_t *const hwBuffer,
                                                 const uint32_t hwBufferSize )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      txBuffers.assign( userBuffer, hwBuffer, hwBufferSize );
      PeripheralState.tx_buffering_enabled = true;
    }
    else if ( periph == Chimera::Hardware::SubPeripheral::RX )
    {
      rxBuffers.assign( userBuffer, hwBuffer, hwBufferSize );
      PeripheralState.rx_buffering_enabled = true;
    }
    else
    {
      error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
    }

    return error;
  }

  Chimera::Status_t USARTClass::disableBuffering( const Chimera::Hardware::SubPeripheral periph )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      PeripheralState.tx_buffering_enabled = false;
    }
    else if ( periph == Chimera::Hardware::SubPeripheral::RX )
    {
      PeripheralState.tx_buffering_enabled = false;
    }
    else
    {
      error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
    }

    return error;
  }

  Chimera::Status_t USARTClass::attachNotifier( const Chimera::Event::Trigger event, SemaphoreHandle_t *const semphr )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    if ( !semphr )
    {
      error = Chimera::CommonStatusCodes::INVAL_FUNC_PARAM;
    }
    else if ( event == Chimera::Event::Trigger::READ_COMPLETE )
    {
      rxCompleteWakeup = semphr;
    }
    else if ( event == Chimera::Event::Trigger::WRITE_COMPLETE )
    {
      txCompleteWakeup = semphr;
    }
    else
    {
      error = Chimera::CommonStatusCodes::NOT_SUPPORTED;
    }

    return error;
  }

  Chimera::Status_t USARTClass::detachNotifier( const Chimera::Event::Trigger event, SemaphoreHandle_t *const semphr )
  {
    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    if ( event == Chimera::Event::Trigger::READ_COMPLETE )
    {
      rxCompleteWakeup = nullptr;
    }
    else if ( event == Chimera::Event::Trigger::WRITE_COMPLETE )
    {
      txCompleteWakeup = nullptr;
    }
    else
    {
      error = Chimera::CommonStatusCodes::NOT_SUPPORTED;
    }

    return error;
  }

  bool USARTClass::available( size_t *const bytes )
  {
    bool retval = false;

    if ( auto tmp = rxBuffers.get(); tmp && !tmp->empty() )
    {
      retval = true;

      if ( bytes )
      {
        *bytes = tmp->size();
      }
    }

    return retval;
  }

  void USARTClass::await( const Chimera::Event::Trigger event )
  {
    // TODO: Refactor into arrays keyed off of the event
    if ( ( event == Chimera::Event::Trigger::READ_COMPLETE ) && ( rxMode != Chimera::Hardware::SubPeripheralMode::BLOCKING ) )
    {
      xSemaphoreTake( awaitEventRXComplete, portMAX_DELAY );
    }

    if ( ( event == Chimera::Event::Trigger::WRITE_COMPLETE ) && ( txMode != Chimera::Hardware::SubPeripheralMode::BLOCKING ) )
    {
      xSemaphoreTake( awaitEventTXComplete, portMAX_DELAY );
    }
  }

  void USARTClass::await( const Chimera::Event::Trigger event, SemaphoreHandle_t notifier )
  {
    /*------------------------------------------------
    Currently not supported
    ------------------------------------------------*/
    Chimera::Watchdog::invokeTimeout();
  }

  bool USARTClass::setWordLength( USART_InitTypeDef &initStruct, const Chimera::Serial::CharWid width )
  {
    switch ( static_cast<uint8_t>( width ) )
    {
      case static_cast<uint8_t>( CharWid::CW_8BIT ):
      default:
        initStruct.WordLength = USART_WORDLENGTH_8B;
        break;
    }

    /* All cases are handled, so it will always return true */
    return true;
  }

  bool USARTClass::setParity( USART_InitTypeDef &initStruct, const Chimera::Serial::Parity parity )
  {
    switch ( static_cast<uint8_t>( parity ) )
    {
      case static_cast<uint8_t>( Parity::PAR_EVEN ):
        initStruct.Parity = USART_PARITY_EVEN;
        break;

