brandonbraun653/Thor/Thor/thor_stm32hal_usart.cpp
      /*------------------------------------------------
      Stop any background listening for data and restart with the new transfer
      ------------------------------------------------*/
      HAL_USART_DMAStop( &usart_handle );
      memset( rxBuffers.internal, 0, rxBuffers.internalSize );
      stm32Error = HAL_USART_Receive_DMA( &usart_handle, rxBuffers.internal, static_cast<uint16_t>( length ) );

      if ( stm32Error == HAL_OK )
      {
        error = Chimera::Serial::Status::RX_IN_PROGRESS;
      }
      else
      {
        error = convertHALStatus( stm32Error );
      }

      unlock();
    }
    else
    {
      error = Chimera::CommonStatusCodes::MEMORY;
    }

    return error;
  }

  Chimera::Status_t USARTClass::writeBlocking( const uint8_t *const buffer, const size_t length, const uint32_t timeout_mS )
  {
    HAL_StatusTypeDef stm32Error = HAL_BUSY;

    if ( lock( Chimera::Threading::TIMEOUT_DONT_WAIT ) == Chimera::CommonStatusCodes::OK )
    {
#if defined( USING_FREERTOS )
      stm32Error = HAL_USART_Transmit( &usart_handle, const_cast<uint8_t *>( buffer ), static_cast<uint16_t>( length ),
                                       pdMS_TO_TICKS( BLOCKING_TIMEOUT_MS ) );
#else
      stm32Error = HAL_USART_Transmit( &usart_handle, const_cast<uint8_t *>( buffer ), static_cast<uint16_t>( length ),
                                       BLOCKING_TIMEOUT_MS );
#endif
      unlock();
    }
    return convertHALStatus( stm32Error );
  }

  Chimera::Status_t USARTClass::writeInterrupt( const uint8_t *const buffer, const size_t length, const uint32_t timeout_mS )
  {
    HAL_StatusTypeDef stm32Error = HAL_OK;
    Chimera::Status_t error      = Chimera::CommonStatusCodes::OK;

    /* clang-format off */
    if ( txBuffers.initialized()
      && PeripheralState.tx_buffering_enabled 
      && lock( Chimera::Threading::TIMEOUT_DONT_WAIT ) == Chimera::CommonStatusCodes::OK )
    { /* clang-format on */
      if ( tx_complete )
      {
        /*------------------------------------------------
        Hardware is free. Send the data directly.
        ------------------------------------------------*/
        tx_complete = false;
        stm32Error  = HAL_USART_Transmit_IT( &usart_handle, const_cast<uint8_t *>( buffer ), static_cast<uint16_t>( length ) );
        error       = convertHALStatus( stm32Error );
      }
      else
      {
        /*------------------------------------------------
        Queue up everything to send later
        ------------------------------------------------*/
        error = Chimera::CommonStatusCodes::BUSY;
        txBuffers.push( buffer, length );
      }

      unlock();
    }
    else
    {
      error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
    }

    return error;
  }

  Chimera::Status_t USARTClass::writeDMA( const uint8_t *const buffer, const size_t length, const uint32_t timeout_mS )
  {
    HAL_StatusTypeDef stm32Error = HAL_OK;
    Chimera::Status_t error      = Chimera::CommonStatusCodes::OK;

    /* clang-format off */
      if ( txBuffers.initialized() 
        && PeripheralState.tx_buffering_enabled 
        && lock( Chimera::Threading::TIMEOUT_DONT_WAIT ) == Chimera::CommonStatusCodes::OK )
      { /* clang-format on */
      if ( tx_complete )
      {
        /*------------------------------------------------
        Hardware is free. Send the data directly.
        ------------------------------------------------*/
        tx_complete = false;
        stm32Error  = HAL_USART_Transmit_DMA( &usart_handle, const_cast<uint8_t *>( buffer ), static_cast<uint16_t>( length ) );
        error       = convertHALStatus( stm32Error );
      }
      else
      {
        /*------------------------------------------------
        Queue up everything to send later
        ------------------------------------------------*/
        error = Chimera::CommonStatusCodes::BUSY;
        txBuffers.push( buffer, length );
      }

      unlock();
    }
    else
    {
      error = Chimera::CommonStatusCodes::NOT_INITIALIZED;
    }

    return error;
  }

  void USARTClass::IRQHandler_TXDMA()
  {
    HAL_DMA_IRQHandler( usart_handle.hdmatx );
  }

  void USARTClass::IRQHandler_RXDMA()
  {
    HAL_DMA_IRQHandler( usart_handle.hdmarx );
  }

  Chimera::Status_t USARTClass::USART_Init()
  {
    using namespace Chimera::Hardware;

    Chimera::Status_t error = Chimera::CommonStatusCodes::OK;

    USART_EnableClock();

    if ( HAL_USART_Init( &usart_handle ) != HAL_OK )
    {
      error                      = Chimera::CommonStatusCodes::FAIL;
      PeripheralState.configured = false;
    }

    if ( error == Chimera::CommonStatusCodes::OK )
    {
      setMode( Chimera::Hardware::SubPeripheral::TX, SubPeripheralMode::BLOCKING );
      setMode( Chimera::Hardware::SubPeripheral::RX, SubPeripheralMode::BLOCKING );

      PeripheralState.configured = true;
    }
    return error;
  }

  void USARTClass::USART_DeInit()
  {
    HAL_USART_DeInit( &usart_handle );
    PeripheralState.configured = false;
  }

  void USARTClass::USART_EnableClock()
  {
#if defined( SIM )
#else
    *getUsartClockReg( usart_handle.Instance ) |= ( usartClockMask( usart_handle.Instance ) );
#endif /* SIM */
  }

  void USARTClass::USART_DisableClock()
  {
#if defined( SIM )
#else
    *getUsartClockReg( usart_handle.Instance ) &= ~( usartClockMask( usart_handle.Instance ) );
#endif /* SIM */
  }

  void USARTClass::USART_DMA_EnableClock()
  {
    /* Global DMA Clock options. Only turn on capability is
    provided due to other peripherals possibly using DMA. */

#if defined( SIM )
#else
    if ( __HAL_RCC_DMA1_IS_CLK_DISABLED() )
    {
      __HAL_RCC_DMA1_CLK_ENABLE();
    }

    if ( __HAL_RCC_DMA2_IS_CLK_DISABLED() )
    {
      __HAL_RCC_DMA2_CLK_ENABLE();
    }
#endif /* SIM */
  }

  void USARTClass::USART_EnableInterrupts()
  {
    using namespace Chimera::Hardware;

    HAL_NVIC_DisableIRQ( ITSettings_HW.IRQn );
    HAL_NVIC_ClearPendingIRQ( ITSettings_HW.IRQn );
    HAL_NVIC_SetPriority( ITSettings_HW.IRQn, ITSettings_HW.preemptPriority, ITSettings_HW.subPriority );
    HAL_NVIC_EnableIRQ( ITSettings_HW.IRQn );

