brandonbraun653/Thor/Thor/thor_stm32hal_usart.cpp
    /*------------------------------------------------
    Make sure we are able to asynchronously receive some data if it gets sent
    ------------------------------------------------*/
    AUTO_ASYNC_RX = true;
    if ( rxMode == SubPeripheralMode::INTERRUPT )
    {
      /*------------------------------------------------
      In interrupt mode, we have to handle the RX FIFO on a byte by byte
      basis otherwise an overrun error is generated.
      ------------------------------------------------*/
#if defined( SIM )
#else
      __HAL_USART_ENABLE_IT( &usart_handle, USART_IT_RXNE );
#endif /* SIM */
    }

    PeripheralState.interrupts_enabled = true;
  }

  void USARTClass::USART_DisableInterrupts()
  {
#if defined( SIM )
#else
    __HAL_USART_DISABLE_IT( &usart_handle, USART_IT_IDLE );
    __HAL_USART_DISABLE_IT( &usart_handle, USART_IT_RXNE );
#endif /* SIM */

    HAL_NVIC_DisableIRQ( ITSettings_HW.IRQn );
    HAL_NVIC_ClearPendingIRQ( ITSettings_HW.IRQn );

    PeripheralState.interrupts_enabled = false;
  }

  void USARTClass::USART_GPIO_Init()
  {
    PeripheralState.gpio_enabled = true;

    if ( !tx_pin || ( tx_pin->setMode( Chimera::GPIO::Drive::ALTERNATE_PUSH_PULL, true ) != Chimera::CommonStatusCodes::OK ) )
    {
      PeripheralState.gpio_enabled = false;
    }

    if ( !rx_pin || ( rx_pin->setMode( Chimera::GPIO::Drive::ALTERNATE_PUSH_PULL, true ) != Chimera::CommonStatusCodes::OK ) )
    {
      PeripheralState.gpio_enabled = false;
    }
  }

  void USARTClass::USART_GPIO_DeInit()
  {
    // TODO: Implement GPIO DeInit
  }

  void USARTClass::USART_DMA_Init( const Chimera::Hardware::SubPeripheral periph )
  {
    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      USART_DMA_EnableClock();
      hdma_usart_tx.Instance = const_cast<DMA_Stream_TypeDef *>( hwConfig[ usart_channel ]->dmaTX.Instance );

      /* Grab the default init settings and modify for the specific hardware */
      hdma_usart_tx.Init           = dflt_DMA_Init_TX;
      hdma_usart_tx.Init.Channel   = hwConfig[ usart_channel ]->dmaTX.channel;
      hdma_usart_tx.Init.Direction = hwConfig[ usart_channel ]->dmaTX.direction;

      /* Hard error if initialization fails. */
      HAL_DMA_Init( &hdma_usart_tx );
      __HAL_LINKDMA( &usart_handle, hdmatx, hdma_usart_tx );

      /*------------------------------------------------
      Attach the class specific implementation TX DMA handler
      ------------------------------------------------*/
      Thor::DMA::requestHandlers[ dmaTXReqSig ] = boost::bind( &USARTClass::IRQHandler_TXDMA, this );

      USART_DMA_EnableIT( periph );

      PeripheralState.dma_enabled_tx = true;
    }
    else
    {
      USART_DMA_EnableClock();
      hdma_usart_rx.Instance = const_cast<DMA_Stream_TypeDef *>( hwConfig[ usart_channel ]->dmaRX.Instance );

      /* Grab the default init settings and modify for the specific hardware */
      hdma_usart_rx.Init           = dflt_DMA_Init_RX;
      hdma_usart_rx.Init.Channel   = hwConfig[ usart_channel ]->dmaRX.channel;
      hdma_usart_rx.Init.Direction = hwConfig[ usart_channel ]->dmaRX.direction;

      /* Hard error if initialization fails. */
      HAL_DMA_Init( &hdma_usart_rx );
      __HAL_LINKDMA( &usart_handle, hdmarx, hdma_usart_rx );

      /*------------------------------------------------
      Attach the class specific implementation TX DMA handler
      ------------------------------------------------*/
      Thor::DMA::requestHandlers[ dmaRXReqSig ] = boost::bind( &USARTClass::IRQHandler_RXDMA, this );

      USART_DMA_EnableIT( periph );

      PeripheralState.dma_enabled_rx = true;
    }
  }

  void USARTClass::USART_DMA_DeInit( const Chimera::Hardware::SubPeripheral periph )
  {
    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      if ( !PeripheralState.dma_enabled_tx )
        return;

      HAL_DMA_Abort( usart_handle.hdmatx );
      HAL_DMA_DeInit( usart_handle.hdmatx );
      USART_DMA_DisableIT( periph );
      Thor::DMA::requestHandlers[ dmaTXReqSig ].clear();

      PeripheralState.dma_enabled_tx = false;
    }
    else
    {
      if ( !PeripheralState.dma_enabled_rx )
        return;

      HAL_DMA_Abort( usart_handle.hdmarx );
      HAL_DMA_DeInit( usart_handle.hdmarx );
      USART_DMA_DisableIT( periph );
      Thor::DMA::requestHandlers[ dmaRXReqSig ].clear();

      PeripheralState.dma_enabled_rx = false;
    }
  }

  void USARTClass::USART_DMA_EnableIT( const Chimera::Hardware::SubPeripheral periph )
  {
    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      HAL_NVIC_DisableIRQ( ITSettings_DMA_TX.IRQn );
      HAL_NVIC_ClearPendingIRQ( ITSettings_DMA_TX.IRQn );
      HAL_NVIC_SetPriority( ITSettings_DMA_TX.IRQn, ITSettings_DMA_TX.preemptPriority, ITSettings_DMA_TX.subPriority );
      HAL_NVIC_EnableIRQ( ITSettings_DMA_TX.IRQn );

      PeripheralState.dma_interrupts_enabled_tx = true;
    }
    else
    {
      HAL_NVIC_DisableIRQ( ITSettings_DMA_RX.IRQn );
      HAL_NVIC_ClearPendingIRQ( ITSettings_DMA_RX.IRQn );
      HAL_NVIC_SetPriority( ITSettings_DMA_RX.IRQn, ITSettings_DMA_RX.preemptPriority, ITSettings_DMA_RX.subPriority );
      HAL_NVIC_EnableIRQ( ITSettings_DMA_RX.IRQn );

      PeripheralState.dma_interrupts_enabled_rx = true;
    }
  }

  void USARTClass::USART_DMA_DisableIT( const Chimera::Hardware::SubPeripheral periph )
  {
    if ( periph == Chimera::Hardware::SubPeripheral::TX )
    {
      HAL_NVIC_ClearPendingIRQ( ITSettings_DMA_TX.IRQn );
      HAL_NVIC_DisableIRQ( ITSettings_DMA_TX.IRQn );

      PeripheralState.dma_interrupts_enabled_tx = false;
    }
    else
    {
      HAL_NVIC_ClearPendingIRQ( ITSettings_DMA_RX.IRQn );
      HAL_NVIC_DisableIRQ( ITSettings_DMA_RX.IRQn );

      PeripheralState.dma_interrupts_enabled_rx = false;
    }
  }

  void USARTClass::USART_OverrunHandler()
  {
#if defined( STM32F7 )
    __HAL_USART_CLEAR_IT( &usart_handle, USART_CLEAR_OREF );
    usart_handle.Instance->RDR;
#endif
  }


#if defined( STM32F4 )
  void USARTClass::IRQHandler()
  {
    using namespace Chimera::Hardware;

