brandonbraun653/Thor/Thor/thor_stm32hal_usart.cpp
    /*------------------------------------------------
    Handle Asynchronous RX in Interrupt and DMA Mode:
    The user did not ask for data, but we got some anyways (cause we were listening)
    ------------------------------------------------*/
    if ( AUTO_ASYNC_RX )
    {
      /*------------------------------------------------
      Reading these registers in the order of SR then DR ends up clearing all
      flags, so it's best to store the returned contents for further processing.
      ------------------------------------------------*/
      volatile uint32_t isrflags = READ_REG( usart_handle.Instance->SR );
      volatile uint32_t data_reg = READ_REG( usart_handle.Instance->DR );
      volatile uint32_t cr1      = READ_REG( usart_handle.Instance->CR1 );

      /*------------------------------------------------
      Prepare necessary flags for ISR flow control
      ------------------------------------------------*/
      bool RX_DATA_READY    = ( ( isrflags & USART_FLAG_RXNE ) == USART_FLAG_RXNE );
      bool RX_LINE_IDLE     = ( ( isrflags & USART_FLAG_IDLE ) == USART_FLAG_IDLE );
      bool RX_DATA_READY_IE = ( ( cr1 & USART_CR1_RXNEIE ) == USART_CR1_RXNEIE );
      bool RX_LINE_IDLE_IE  = ( ( cr1 & USART_CR1_IDLEIE ) == USART_CR1_IDLEIE );

      /*------------------------------------------------
      RX In Progress
      ------------------------------------------------*/
      if ( RX_DATA_READY 
        && RX_DATA_READY_IE 
        && usart_handle.State != HAL_USART_STATE_BUSY_TX )
      {
        uint32_t error = ( isrflags & ( uint32_t )( USART_SR_PE | USART_SR_FE | USART_SR_ORE | USART_SR_NE ) );

        if ( !error )
        {
          /*------------------------------------------------
          Detected start of a new frame of unknown size. Enable
          the IDLE interrupt bit to detect the end of frame.
          ------------------------------------------------*/
          if ( asyncRXDataSize == 0 )
          {
            USART_EnableIT_IDLE( &usart_handle );
            memset( rxBuffers.internal, 0, rxBuffers.internalSize );
          }

          /*------------------------------------------------
          Buffer the received byte to our internal buffer
          ------------------------------------------------*/
          if ( rxMode == SubPeripheralMode::INTERRUPT && ( asyncRXDataSize < rxBuffers.internalSize ) )
          {
            rxBuffers.internal[ asyncRXDataSize ] = static_cast<uint8_t>( data_reg );
            asyncRXDataSize += 1u;
          }
          else if ( rxMode != SubPeripheralMode::DMA )
          {
            // The receive buffer was full!!!! We lost data! Somehow set an error.
            // Probably should set this as Chimera thing.
          }
        }
      }

      /*------------------------------------------------
      RX Complete
      ------------------------------------------------*/
      if ( RX_LINE_IDLE && RX_LINE_IDLE_IE )
      {
        if ( rxMode == SubPeripheralMode::INTERRUPT )
        {
          /*------------------------------------------------
          Turn off the idle line interrupt so we aren't interrupted again
          while trying to process all the information just received.
          ------------------------------------------------*/
          USART_DisableIT_IDLE( &usart_handle );

          /*------------------------------------------------
          Manually call this function because HAL_USART_IRQHandler won't get called
          and it normally handles this operation.
          ------------------------------------------------*/
          HAL_USART_RxCpltCallback( &usart_handle );
        }
        else /* DMA */
        {
          /*------------------------------------------------
          Turn off the idle line interrupt so we aren't interrupted again
          while trying to process all the information just received.
          ------------------------------------------------*/
          USART_DisableIT_IDLE( &usart_handle );

          /*------------------------------------------------
          Force DMA hard reset to trigger the DMA RX Complete handler
          ------------------------------------------------*/
          __HAL_DMA_DISABLE( usart_handle.hdmarx );
        }
      }
    }

    /*------------------------------------------------
    Handle when the standard IRQHandler is called:

    1. We are TX-ing in IT or DMA mode (getting to this func means we are in those modes)
    2. We are RX-ing an expected asynchronous transfer that the user started
    ------------------------------------------------*/
    if ( !AUTO_ASYNC_RX || usart_handle.State == HAL_USART_STATE_BUSY_TX )
    {
      HAL_USART_IRQHandler( &usart_handle );
    }
  }
#endif /* STM32F4 */
    
    
#if defined( STM32F7 )
  void USARTClass::IRQHandler()
  {
    using namespace Chimera::Hardware;
  }
#endif /* STM32F7 */
  
}    // namespace Thor::USART

#if !defined( GMOCK_TEST )
void HAL_USART_TxCpltCallback( USART_HandleTypeDef *UsartHandle )
{
  const auto usart = getUSARTClassRef( UsartHandle->Instance );

  if ( usart )
  {
    usart->isrPostProcessingComplete = false;
    usart->eventBits |= Chimera::Event::Flags::BIT_WRITE_COMPLETE;

    /*------------------------------------------------
    Wake up and immediately switch to the user-land ISR
    handler thread. Should be a very high priority thread.
    ------------------------------------------------*/
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR( isrPPWakeup[ usart->usart_channel ], &xHigherPriorityTaskWoken );
    portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
  }
}

void HAL_USART_RxCpltCallback( USART_HandleTypeDef *UsartHandle )
{
  const auto usart = getUSARTClassRef( UsartHandle->Instance );

  if ( usart )
  {
    usart->isrPostProcessingComplete = false;
    usart->eventBits |= Chimera::Event::Flags::BIT_READ_COMPLETE;

    /*------------------------------------------------
    Wake up and immediately switch to the user-land ISR
    handler thread. Should be a very high priority thread.
    ------------------------------------------------*/
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR( isrPPWakeup[ usart->usart_channel ], &xHigherPriorityTaskWoken );
    portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
  }
}

void HAL_USART_TxHalfCpltCallback( USART_HandleTypeDef *UsartHandle )
{
}

void HAL_USART_RxHalfCpltCallback( USART_HandleTypeDef *UsartHandle )
{
}

void HAL_USART_ErrorCallback( USART_HandleTypeDef *UsartHandle )
{
}
#endif /* !GMOCK_TEST */

void USART1_IRQHandler( void )
{
  if ( usartObjects[ 1 ] )
  {
    usartObjects[ 1 ]->IRQHandler();
  }
}

void USART2_IRQHandler( void )
{
  if ( usartObjects[ 2 ] )
  {
    usartObjects[ 2 ]->IRQHandler();
  }
}

void USART3_IRQHandler( void )
{
  if ( usartObjects[ 3 ] )
  {
    usartObjects[ 3 ]->IRQHandler();
  }
}

