brandonbraun653/Thor/Thor/thor_stm32hal_usart.cpp
void USART6_IRQHandler( void )
{
  if ( usartObjects[ 6 ] )
  {
    usartObjects[ 6 ]->IRQHandler();
  }
}

static USARTClass *const getUSARTClassRef( USART_TypeDef *const instance )
{
  /*------------------------------------------------
  Simply converts the pointer into the raw numerical address value, which be compared against
  the peripheral base address. USARTx is simply (USART_TypeDef*)USARTx_Base.
  ------------------------------------------------*/
  auto i = reinterpret_cast<std::uintptr_t>( instance );
  switch ( i )
  {
#if defined( USART1 )
    case USART1_BASE:
      return usartObjects[ 1 ];
      break;
#endif
#if defined( USART2 )
    case USART2_BASE:
      return usartObjects[ 2 ];
      break;
#endif
#if defined( USART3 )
    case USART3_BASE:
      return usartObjects[ 3 ];
      break;
#endif
#if defined( USART4 )
    case USART4_BASE:
      return usartObjects[ 4 ];
      break;
#endif
#if defined( USART5 )
    case USART5_BASE:
      return usartObjects[ 5 ];
      break;
#endif
#if defined( USART6 )
    case USART6_BASE:
      return usartObjects[ 6 ];
      break;
#endif
#if defined( USART7 )
    case USART7_BASE:
      return usartObjects[ 7 ];
      break;
#endif
#if defined( USART8 )
    case USART8_BASE:
      return usartObjects[ 8 ];
      break;
#endif

    default:
      return usartObjects[ 0 ];
      break;
  };
};

static volatile uint32_t *getUsartClockReg( USART_TypeDef *const instance )
{
  auto i = reinterpret_cast<std::uintptr_t>( instance );
  switch ( i )
  {
#if defined( STM32F446xx ) || defined( STM32F767xx )
#if defined( USART1 )
    case USART1_BASE:
      return &( RCC->APB2ENR );
      break;
#endif
#if defined( USART2 )
    case USART2_BASE:
      return &( RCC->APB1ENR );
      break;
#endif
#if defined( USART3 )
    case USART3_BASE:
      return &( RCC->APB1ENR );
      break;
#endif
#if defined( USART6 )
    case USART6_BASE:
      return &( RCC->APB2ENR );
      break;
#endif
#endif /* !STM32F446xx  !STM32F767xx */

    default:
      return nullptr;
      break;
  };
}

static uint32_t usartClockMask( USART_TypeDef *const instance )
{
  auto i = reinterpret_cast<std::uintptr_t>( instance );
  switch ( i )
  {
#if defined( STM32F446xx ) || defined( STM32F767xx )
#if defined( USART1 )
    case USART1_BASE:
      return RCC_APB2ENR_USART1EN;
      break;
#endif
#if defined( USART2 )
    case USART2_BASE:
      return RCC_APB1ENR_USART2EN;
      break;
#endif
#if defined( USART3 )
    case USART3_BASE:
      return RCC_APB1ENR_USART3EN;
      break;
#endif
#if defined( USART6 )
    case USART6_BASE:
      return RCC_APB2ENR_USART6EN;
      break;
#endif
#endif /* !STM32F446xx  !STM32F767xx */

    default:
      return 0u;
      break;
  };
};

static constexpr bool isChannelSupported( const uint8_t channel )
{
  return ( ( channel == 1 ) || ( channel == 2 ) || ( channel == 3 ) || ( channel == 6 ) );
}

static void USART1ISRPostProcessor( void *argument )
{
  static constexpr uint8_t channel = 1u;

  Chimera::Threading::signalSetupComplete();

  while ( 1 )
  {
    if ( xSemaphoreTake( isrPPWakeup[ channel ], portMAX_DELAY ) == pdPASS )
    {
      if ( auto usart = usartObjects[ channel ]; usart )
      {
        usart->postISRProcessing();
      }
    }
  }
}

static void USART2ISRPostProcessor( void *argument )
{
  static constexpr uint8_t channel = 2u;

  Chimera::Threading::signalSetupComplete();

  while ( 1 )
  {
    if ( xSemaphoreTake( isrPPWakeup[ channel ], portMAX_DELAY ) == pdPASS )
    {
      if ( auto usart = usartObjects[ channel ]; usart )
      {
        usart->postISRProcessing();
      }
    }
  }
}

static void USART3ISRPostProcessor( void *argument )
{
  static constexpr uint8_t channel = 3u;

  Chimera::Threading::signalSetupComplete();

  while ( 1 )
  {
    if ( xSemaphoreTake( isrPPWakeup[ channel ], portMAX_DELAY ) == pdPASS )
    {
      if ( auto usart = usartObjects[ channel ]; usart )
      {
        usart->postISRProcessing();
      }
    }
  }
}

static void USART6ISRPostProcessor( void *argument )
{
  static constexpr uint8_t channel = 6u;

  Chimera::Threading::signalSetupComplete();

  while ( 1 )
  {
    if ( xSemaphoreTake( isrPPWakeup[ channel ], portMAX_DELAY ) == pdPASS )
    {
      if ( auto usart = usartObjects[ channel ]; usart )
      {
        usart->postISRProcessing();
      }
    }
  }
}

#endif /* THOR_STM32HAL_DRIVERS && THOR_DRIVER_USART */
